General_Userflow.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="csfoodkirtilt.qcepvp5t4b.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
<!--
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="30" unit="second"></users>
    </arrivalphase>
-->
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"></option>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
      Firefox/1.0.4
      </user_agent>
    </option>
  </options>

  <sessions>
    <session name="General-Workflow" probability="100" type="ts_http">

     <!-- create a user -->
     <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request>
        <http url='/users/sign_up' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <setdynvars sourcetype="random_string" length="8">
        <var name="uname"/>
        <var name="oname"/>
      </setdynvars>
      <request subst="true">
        <http url='/users' version='1.1' method='POST'
              contents="commit=Sign+up&amp;
              user%5Bbirthday%5D=1900%2F10%2F10&amp;
              user%5Bemail%5D=%%_uname%%%40gmail.com&amp;
              user%5Bfirst_name%5D=slkdfjslkdjf&amp;
              user%5Blast_name%5D=slkdj&amp;
              user%5Bpassword%5D=Appfolio55&amp;
              user%5Bpassword_confirmation%5D=Appfolio55&amp;
              user%5Bphone_number%5D=456-456-4567&amp;
              user%5Busername%5D=%%_uname%%&amp;
              utf8=%E2%9C%93"></http>
      </request>
      <thinktime value="3" random="true"></thinktime>
      
      <!-- create an order -->
      <request>
        <http url='/orders/new' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/orders' version='1.1' method='POST'
              contents="commit=Save+Order&amp;order%5Btext%5D=%%_oname%%&amp;order%5Btitle%5D=%%_oname%%"></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      
      <!-- pick 2 orders -->
      <setdynvars sourcetype="random_number" start="1" end="10000">
        <var name="rndord1"/>
        <var name="rndord2"/>
      </setdynvars>

      <request>
        <http url='/orders' version='1.1' method='GET'></http>
      </request>
      <request subst="true">
        <http url="/orders/%%_rndord1%%/pick" version='1.1' method='PUT'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>

      <request>
        <http url='/orders' version='1.1' method='GET'></http>
      </request>
      <request subst="true">
        <http url="/orders/%%_rndord2%%/pick" version='1.1' method='PUT'></http>
      </request>
        <thinktime value="2" random="true"></thinktime>
      
      <!-- view my order history -->
      <request>
        <http url='/orders/myhistory' version='1.1' method='GET'></http>
      </request>
      
    </session>
  </sessions>
</tsung>