various_sessions.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="34.216.130.85" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="30" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"></option>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
        Firefox/1.0.4
      </user_agent>
    </option>
  </options>

  <sessions>
    <session name="CREATE-ORDER-5-ITEMS" probability="1" type="ts_http">
      <!--UNTESTED, ASSUMES LOGGED IN & IM NOT SURE IF ITEMS ARE CORRECT-->
      <request>
        <http url='/orders/new' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/orders' version='1.1' method='POST'
              contents="commit=Save+Order&amp;
              order%5Btitle%5D=pizza&amp;
              order%5Btext%5D=i+love+pizza%21&amp;
              order%5Bitem_1%5D=&amporder%5Bitem_1_text%5D=peppies&amp;
              order%5Bitem_2%5D=&order%5Bitem_2_text%5D=cheese&amp;
              order%5Bitem_3%5D=&order%5Bitem_3_text%5D=crust&amp;
              order%5Bitem_4%5D=&order%5Bitem_4_text%5D=anchoves&amp;
              order%5Bitem_5%5D=&order%5Bitem_5_text%5D=brocolli&amp;
              order%5Bpoints%5D=0&amp;
              utf8=%E2%9C%93"></http>
      </request>
    </session>

    <session name="CREATE-ITEM" probability="1" type="ts_http">
      <!-- UNTESTED, but should work -->
      <setdynvars sourcetype="random_string" length="5">
        <var name="itemName"/>
      </setdynvars>
      <request>
        <http url='/items/new' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/items' version='1.1' method='POST'
              contents="commit=Create+Item&amp;
              item%5Bname%5D=%%_itemName%%&amp;
              utf8=%E2%9C%93"></http>
      </request>
    </session>

    <session name="EDIT-ORDER" probability="1" type="ts_http">
      <!--UNTESTED, RANDOMLY SELECTS ORDER-->
      <setdynvars sourcetype="random_number" start="1" end="5">
        <var name="rndint"/>
      </setdynvars>
      <request>
        <http url='/orders/%%_rndint%%/edit' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/orders/%%_rndint%%' version='1.1' method='POST'
              contents="commit=Update%20Order&amp;
              _method=patch&amp;
              order%5Btitle%5D=fake_edit&amp;
              order%5Btext%5D=hellodawgo&amp;
              utf8=%E2%9C%93"></http>
      </request>
    </session>

    <session name="PICK-ORDERS" probability="1" type="ts_http">
      <!--UNTESTED, CAN SET A RANGE OF IDS TO PICK-->
      <!-- MAY NEED TO KEEP TRACK OF WHICH ORDERS HAVE BEEN PICKED -->
      <setdynvars sourcetype="random_number" start="1" end="5">
        <var name="rndint"/>
      </setdynvars>
      <request>
        <http url='/orders' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/orders/%%_rndint%%/pick' version='1.1' method='POST'></http>
      </request>
    </session>

    <session name="DEL-ORDERS" probability="1" type="ts_http">
      <!--UNTESTED, idk how to set method; CAN SET A RANGE OF IDS TO PICK-->
      <!-- NEED TO KEEP TRACK OF WHICH ORDERS HAVE BEEN DELETED -->
      <setdynvars sourcetype="random_number" start="1" end="5">
        <var name="rndint"/>
      </setdynvars>
      <request>
        <http url='/myorders' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/orders/%%_rndint%%?continue_to=%2Forders%2Fmyorders' version='1.1' method='POST' 
          contents='_method=delete'></http>
      </request>
    </session>

    <session name="VIEW-MYPICKS" probability="1" type="ts_http">
      <!-- simple get request, can be easily replicated to other simple get requets -->
      <request>
        <http url='/orders/mypics' version='1.1' method='GET'></http>
      </request>
    </session>

  </sessions>
</tsung>